Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_acm_certificate.ssl-certificate has changed
~ resource "aws_acm_certificate" "ssl-certificate" {
        id                        = "arn:aws:acm:us-east-1:246850902828:certificate/118ac113-bf99-4639-b632-226b113f7607"
      ~ status                    = "PENDING_VALIDATION" -> "ISSUED"
      + tags                      = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.ssl-cert-validation["*.findafoodtrucknow.ga"] has changed
~ resource "aws_route53_record" "ssl-cert-validation" {
        id              = "Z09800282W96ID4P1H3B4__dc9a77e4eaa65e5ae9e5b7abc0658277.findafoodtrucknow.ga._CNAME"
        name            = "_dc9a77e4eaa65e5ae9e5b7abc0658277.findafoodtrucknow.ga"
        # (6 unchanged attributes hidden)
    }

  # aws_route53_record.ssl-cert-validation["findafoodtrucknow.ga"] has changed
~ resource "aws_route53_record" "ssl-cert-validation" {
        id              = "Z09800282W96ID4P1H3B4__dc9a77e4eaa65e5ae9e5b7abc0658277.findafoodtrucknow.ga._CNAME"
        name            = "_dc9a77e4eaa65e5ae9e5b7abc0658277.findafoodtrucknow.ga"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.s3-home-ipd will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3-home-ipd"  {
      ~ id      = "677448245" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObjectVersion",
                          - "s3:GetObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::foodtrucks20220123172537018100000001/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::246850902828:user/github-actions"
                        }
                      - Resource  = "arn:aws:s3:::foodtrucks20220123172537018100000001/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # data.aws_iam_policy_document.s3-redirect-ipd will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3-redirect-ipd"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:GetObjectVersion",
            ]
          + resources = [
              + "arn:aws:s3:::foodtrucks20220123172537018100000001/*",
            ]

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::246850902828:user/github-actions",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_cloudfront_distribution.root_s3_distribution will be created
+ resource "aws_cloudfront_distribution" "root_s3_distribution" {
      + aliases                        = [
          + "findafoodtrucknow.ga",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = {
          + "project" = "findafoodtruck"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = [
                  + "Origin",
                ]
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = (known after apply)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:246850902828:certificate/118ac113-bf99-4639-b632-226b113f7607"
          + minimum_protocol_version = "TLSv1.1_2016"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_distribution.www_s3_distribution will be created
+ resource "aws_cloudfront_distribution" "www_s3_distribution" {
      + aliases                        = [
          + "www.findafoodtrucknow.ga",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = {
          + "project" = "findafoodtruck"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 31536000
          + max_ttl                = 31536000
          + min_ttl                = 31536000
          + target_origin_id       = "S3-www.foodtrucks20220123172537018100000001"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "foodtrucks20220123172537018100000001.s3-website.us-east-2.amazonaws.com"
          + origin_id           = "S3-www.foodtrucks20220123172537018100000001"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:246850902828:certificate/118ac113-bf99-4639-b632-226b113f7607"
          + minimum_protocol_version = "TLSv1.1_2016"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.root-a will be created
+ resource "aws_route53_record" "root-a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "findafoodtrucknow.ga"
      + type            = "A"
      + zone_id         = "Z09800282W96ID4P1H3B4"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.www-a will be created
+ resource "aws_route53_record" "www-a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.findafoodtrucknow.ga"
      + type            = "A"
      + zone_id         = "Z09800282W96ID4P1H3B4"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_s3_bucket.s3-home will be updated in-place
~ resource "aws_s3_bucket" "s3-home" {
        id                          = "foodtrucks20220123172537018100000001"
        tags                        = {}
        # (13 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = [
              + "Authorization",
              + "Content-Length",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
            ]
          + allowed_origins = [
              + "https://www.findafoodtrucknow.ga",
            ]
          + max_age_seconds = 3000
        }


        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.s3-redirect will be created
+ resource "aws_s3_bucket" "s3-redirect" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "foodtrucks"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "project" = "findafoodtruck"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + redirect_all_requests_to = "https://www.findafoodtrucknow.ga"
        }
    }

  # aws_s3_bucket_policy.public-read will be updated in-place
~ resource "aws_s3_bucket_policy" "public-read" {
        id     = "foodtrucks20220123172537018100000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObjectVersion",
                          - "s3:GetObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::foodtrucks20220123172537018100000001/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::246850902828:user/github-actions"
                        }
                      - Resource  = "arn:aws:s3:::foodtrucks20220123172537018100000001/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_policy.s3-redirect-policy will be created
+ resource "aws_s3_bucket_policy" "s3-redirect-policy" {
      + bucket = "foodtrucks20220123172537018100000001"
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 6 to add, 2 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.greenatlantis.ga/lock?id=marknooch%252Ffoodtrucks%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 6 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
